Tekla Open API Reference for Tekla Structures 2025
CrossSectionPoint Class
 The CrossSectionPoint class defines a point with possible chamfering information
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.Point
 Tekla.Structures.Catalogs.CrossSectionPoint
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CrossSectionPoint : Point
<SerializableAttribute>
Public NotInheritable Class CrossSectionPoint
	Inherits Point
The CrossSectionPoint type exposes the following members.
Constructors
Name | Description
CrossSectionPoint
 Creates a new cross section point instance.
Top
Properties
Name | Description
Chamfer
 The chamfer for the cross section point.
Top
Methods
Name | Description
CompareTo
 Compares two points. To use binarysearch somekind of sorting should be used.
 (Inherited from Point.)
Equals
 Returns true if the current object and the given object are equal.
 (Inherited from Point.)
GetHashCode
 Returns a hash code for the point. Notice, in extremely rare cases, you might not get the same hash code for two points even though they are considered equal! This should, however, happen only in extremely rare cases!
 (Inherited from Point.)
ToString
 Formats the point into a string.
 (Inherited from Point.)
Translate
 Translates the point using the given vector.
 (Inherited from Point.)
Zero
 Zeros all the members of the point.
 (Inherited from Point.)
Top
Fields
Name | Description
X
 The X-coordinate of the point.
 (Inherited from Point.)
Y
 The Y-coordinate of the point.
 (Inherited from Point.)
Z
 The Z-coordinate of the point.
 (Inherited from Point.)
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace